<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"1d7b5e87b48b8d6209c28867990afb134780b190cd00fc11b5c55dd8c53e5101","plan_job_ref":"Job Run Terraform plan in staging #216 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14116523696","plan_out_hash":"23b143af7b935d991cbfd4ebc76f15cbf7bfca666f5cf4ed82e7e3e152fe3574","plan_hash":"47d7cb97ea8c2da1e1398f05815b4505a70dabb008cad39a9cc8584d5081aec3","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 5 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2024-12-26T21:38:47Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous_monitoring-staging.app.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "Ud7HxTpTnPh6d9x3TIXQ5IsxQ/e4WKdvDCdJg3J2F+E=" -> "8K4skVfzf9tkny3Kv4x3KtpPCDH3vFgop2mfoAM71YY="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-27T20:35:16Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
        id = "05a74ebf-eccc-3593-abce-90c94c007b39"

-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
-       policy {
-           destination_app = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-           port            = "8080" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "8080"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "99121ff6-67ff-485d-bf03-d92ed152bf51" -> null
-               app_process_type = "web" -> null
-               id               = "0d27950c-8f56-46e2-b81f-91531067b6c6" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "97c72bbd-6eea-4c37-a138-7539079c5684"
!~      updated_at   = "2025-03-27T20:37:14Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2024-12-26T21:32:43Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      path                        = ".terraform/modules/egress_proxy/egress_proxy/proxy.zip" -> "/tmp/terraform-data-dir/modules/egress_proxy/egress_proxy/proxy.zip"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "8fc76efe193b6cde3784e360730dcd4cd5bcabae7ff3fee31a66096e364b5972" -> "175a3a43404fb2a33deaf8fba9e461a196ec830fb1991f4dffac53a6504ffcc8"
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-03-27T20:31:11Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "b7becb44-b1cd-412a-8d0a-ff01e55044b5" -> null
-               app_process_type = "web" -> null
-               id               = "d6379a2c-eeae-4972-999d-7ac2b758479f" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "c5387ea1-136d-4856-85a2-2c9f68e7aa2e"
!~      updated_at   = "2025-03-27T20:33:06Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #216](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14116523696)